exampleCases/example.3.piso.DTU10MW.ALMAdvanced/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                        backward;
//  default                        CrankNicolson 1.0;
}

gradSchemes
{
    default                        Gauss linear;
    grad(U)                        Gauss linear;
}

divSchemes
{
    default                        Gauss linear;
  //div(phi,U)                     Gauss linear;
  //div(phi,T)                     Gauss linear;
    div(phi,U)                     Gauss localBlended linear upwind;
    div(phi,T)                     Gauss localBlended linear upwind;
    div(R)                         Gauss linear;
    div(U)                         Gauss linear;
    div((nuEff*dev(grad(U).T())))  Gauss linear;
    div(B)                         Gauss linear;
    div(phi,B)                     Gauss linear;
    div(phi,k)                     Gauss linear;
}

laplacianSchemes
{
    default                        Gauss linear uncorrected;
    laplacian(rUA,p)               Gauss linear uncorrected;
    laplacian((1|A(U)),p)          Gauss linear uncorrected;
    laplacian(interpolate((1|A(U))),p) Gauss linear uncorrected;
    laplacian(interpolate((1|A(U))),pd) Gauss linear uncorrected;
    laplacian(nu,U)                Gauss linear uncorrected;
    laplacian(nuEff,U)             Gauss linear uncorrected;
    laplacian(kappaEff,T)          Gauss linear uncorrected;
    laplacian(DBEff,B)             Gauss linear uncorrected;
    laplacian(nuSgs,U)             Gauss linear uncorrected;
}

interpolationSchemes
{
    default                        linear;
}

snGradSchemes
{
    default                        uncorrected;
}

fluxRequired
{
    default                        no;
    p                                ;
}

schemeBlending
{
    xBlending1                   -10.0;
    xBlending2                     0.0;
    xBlending3                    60.0;
    xBlending4                    70.0;
    blendingFactor1                0.85;
    blendingFactor2                1.00;
}

// ************************************************************************* //
